var list = [["-7h", "阿姆斯特丹,柏林,罗马.", 1], ["-6h", "开罗,耶路撒冷.", 2], ["-5h", "莫斯科,巴格达,德黑兰.", 3], ["-4h", "迪拜,喀布尔", 4], ["-3h", "伊斯兰堡,孟买,新德里.", 5], ["-2h", "达卡,仰光,库尔干秋别.", 6], ["-1h", "曼谷,河内,雅加达.", 7], ["-0h", "香港", 8], ["-23h", "大阪,东京.", 9], ["-22h", "关岛，布里斯班.", 10], ["-21h", "墨尔本，悉尼.", 11], ["-20h", "马绍尔群岛.", 12], ["-19h", "阿洛菲，奥克兰（新西兰不是美国）.", -11], ["-18h", "苏瓦.", -10], ["-17h", "里基提亚,艾德蒙顿.", -9], ["-16h", "安克雷奇", -8], ["-15h", "圣布鲁诺,旧金山", -7], ["-14h", "盐湖城.", -6], ["-13h", "新奥尔良,墨西哥城,芝加哥.", -5], ["-12h", "加拉加斯", -4], ["-11h", "里约热内卢,蒙得维的亚.", -3], ["-10h", "葛利特维根", -2], ["-9h", "蓬塔德尔加达（葡萄牙）", -1], ["-8h", "伦敦，爱丁堡"], 0];

var obj = {};

for (var i in list) {
    obj[list[i][0]] = list[i];
}

var getCity = function () {
    var d = new Date();
    var h = d.getHours();
    var key = "-" + h + "h";
    var val = obj[key];
    //console.log(val[1])
    return val[1];
};


//express 部分
var router = require("express").Router();

router.get("/", function (req, res) {
    res.send(getCity());
});

module.exports = router;